public class Homework1 {

    public static void main(String[] args) {

        System.out.println("Когда теряет равновесие\n" +
                "твоё сознание усталое,\n" +
                "когда ступеньки этой лестницы\n" +
                "уходят из-под ног,\n" +
                "как палуба,\n" +
                "когда плюёт на человечество\n" +
                "твоё ночное одиночество, —\n" +
                "ты можешь\n" +
                "размышлять о вечности\n" +
                "и сомневаться в непорочности\n" +
                "идей, гипотез, восприятия\n" +
                "произведения искусства,\n" +
                "и — кстати — самого зачатия\n" +
                "Мадонной сына Иисуса.\n" +
                "Но лучше поклоняться данности\n" +
                "с глубокими её могилами,\n" +
                "которые потом,\n" +
                "за давностью,\n" +
                "покажутся такими милыми.\n" +
                "\n" +
                "Да.\n" +
                "Лучше поклоняться данности\n" +
                "с короткими её дорогами,\n" +
                "которые потом\n" +
                "до странности\n" +
                "покажутся тебе\n" +
                "широкими,\n" +
                "покажутся большими,\n" +
                "пыльными,\n" +
                "усеянными компромиссами,\n" +
                "покажутся большими крыльями,\n" +
                "покажутся большими птицами.\n" +
                "\n" +
                "Да. Лучше поклоняться данности\n" +
                "с убогими её мерилами,\n" +
                "которые потом до крайности,\n" +
                "послужат для тебя перилами\n" +
                "(хотя и не особо чистыми),\n" +
                "удерживающими в равновесии\n" +
                "твои хромающие истины\n" +
                "на этой выщербленной лестнице.");


    }
}
