package Students.Olga;

import javax.xml.bind.SchemaOutputResolver;

public class HomeWork_1 {
    public static void main(String[] args) {
        System.out.println("Я научилась просто, мудро жить,\n" +
                "Смотреть на небо и молиться Богу,\n" +
                "И долго перед вечером бродить,\n" +
                "Чтоб утомить ненужную тревогу.\n" +
                "\n" +
                "Когда шуршат в овраге лопухи\n" +
                "И никнет гроздь рябины желто-красной,\n" +
                "Слагаю я веселые стихи\n" +
                "О жизни тленной, тленной и прекрасной.\n" +
                "\n" +
                "Я возвращаюсь. Лижет мне ладонь\n" +
                "Пушистый кот, мурлыкает умильней,\n" +
                "И яркий загорается огонь\n" +
                "На башенке озерной лесопильни.\n" +
                "\n" +
                "Лишь изредка прорезывает тишь\n" +
                "Крик аиста, слетевшего на крышу.\n" +
                "И если в дверь мою ты постучишь,\n" +
                "Мне кажется, я даже не услышу.");
    }
}
