public class HomeWork1 {
    public static void main(String[] args) {
        System.out.println("Ты опять упрекнула меня,\n" +
                "Что я с музой моей раздружился,\n" +
                "Что заботам текущего дня\n" +
                "И забавам его подчинился.\n" +
                "Для житейских расчетов и чар\n" +
                "Не расстался б я с музой моею,\n" +
                "Но бог весть, не погас ли тот дар,\n" +
                "Что, бывало, дружил меня с нею?\n" +
                "Но не брат еще людям поэт,\n" +
                "И тернист его путь, и непрочен,\n" +
                "Я умел не бояться клевет,\n" +
                "Не был ими я сам озабочен;\n" +
                "Но я знал, чье во мраке ночном\n" +
                "Надрывалося сердце с печали,\n" +
                "И на чью они грудь упадали свинцом,\n" +
                "И кому они жизнь отравляли.\n" +
                "И пускай они мимо прошли,\n" +
                "Надо мною ходившие грозы,\n" +
                "Знаю я, чьи молитвы и слезы\n" +
                "Роковую стрелу отвели…\n" +
                "Да и время ушло,— я устал…\n" +
                "Пусть я не был бойцом без упрека,\n" +
                "Но я силы в себе сознавал,\n" +
                "Я во многое верил глубоко,\n" +
                "А теперь — мне пора умирать…\n" +
                "Не затем же пускаться в дорогу,\n" +
                "Чтобы в любящем сердце опять\n" +
                "Пробудить роковую тревогу…\n" +
                "\n" +
                "Присмиревшую музу мою\n" +
                "Я и сам неохотно ласкаю…\n" +
                "Я последнюю песню пою\n" +
                "Для тебя — и тебе посвящаю.\n" +
                "Но не будет она веселей,\n" +
                "Будет много печальнее прежней,\n" +
                "Потому что на сердце темней\n" +
                "И в грядущем еще безнадежней…");
    }
}
